Examples/groovyBC/circulatingSplash/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object blockMeshDict; 	
}

convertToMeters 0.1;

vertices
  (
    (-1 -1 -1)
    (1 -1 -1)
    (1 1 -1)
    (-1 1 -1)
    (-1 -1 1)
    (1 -1 1)
    (1 1 1)
    (-1 1 1)
    (-1 -0.75 -1)
    (1 -0.75 -1)
    (-1 -0.75 1)
    (1 -0.75 1)
    (-1 0 -1)
    (1 0 -1)
    (-1 0 1)
    (1 0 1)
  ); 	

blocks
  (
    hex

    (
      12
      13
      2
      3
      14
      15
      6
      7
    )
    (32 16 32)
    simpleGrading
    (1 1 1)
    hex

    (
      8
      9
      13
      12
      10
      11
      15
      14
    )
    (32 12 32)
    simpleGrading
    (1 1 1)
    hex

    (
      0
      1
      9
      8
      4
      5
      11
      10
    )
    (32 4 32)
    simpleGrading
    (1 1 1)
  ); 	

edges
  (
  ); 	

patches
  (
    patch
    atmosphere

    (

      (
        3
        7
        6
        2
      )
    )
    patch
    sides

    (

      (
        12
        14
        7
        3
      )

      (
        2
        6
        15
        13
      )

      (
        12
        3
        2
        13
      )

      (
        14
        15
        6
        7
      )
    )
    patch
    spill

    (

      (
        10
        11
        15
        14
      )

      (
        11
        9
        13
        15
      )
    )
    wall
    floor

    (

      (
        1
        5
        4
        0
      )

      (
        0
        4
        10
        8
      )

      (
        0
        8
        9
        1
      )

      (
        1
        5
        11
        9
      )

      (
        4
        10
        11
        5
      )

      (
        10
        8
        12
        14
      )

      (
        8
        9
        13
        12
      )
    )
  ); 	

mergePatchPairs
  (
  ); 	

boundary
  (
    atmosphere

    {
      faces
        (

          (
            3
            7
            6
            2
          )
        );
      type patch;

    }
    sides

    {
      faces
        (

          (
            12
            14
            7
            3
          )

          (
            2
            6
            15
            13
          )

          (
            12
            3
            2
            13
          )

          (
            14
            15
            6
            7
          )
        );
      type patch;

    }
    spill

    {
      faces
        (

          (
            10
            11
            15
            14
          )

          (
            11
            9
            13
            15
          )
        );
      type patch;

    }
    floor

    {
      faces
        (

          (
            1
            5
            4
            0
          )

          (
            0
            4
            10
            8
          )

          (
            0
            8
            9
            1
          )

          (
            1
            5
            11
            9
          )

          (
            4
            10
            11
            5
          )

          (
            10
            8
            12
            14
          )

          (
            8
            9
            13
            12
          )
        );
      type wall;

    }
  );

